Repository: healthyentrepreneurs/hemobile
Catalog: packages/theme_locale_repo/lib/l10n/intl_*.arb
Languages: nn

source: Dark theme
nn: Dark theme nn

source: Light theme
nn: Light theme nn

# current_theme_is
source: Current theme is {themeTitle}
nn: Current theme is {themeTitle} nn

# current_language_is
source: Current language is {langName}
nn: Current language is {langName} nn

# change_theme_success
source: Change theme successfully
nn: Change theme successfully nn

source: Change theme failure
nn: Change theme failure nn

# change_theme_failure_cause_by
source: Change theme failure cause by error: {error}
nn: Change theme failure cause by error: {error} nn

# change_language_success
source: Change locale successfully
nn: Change locale successfully nn

# change_language_failure
source: Change locale failure
nn: Change locale failure nn

# change_language_failure_cause_by
source: Change locale failure cause by error: {error}
nn: Change locale failure cause by error: {error} nn

# pageHomeBalance
source: Your balance is {amount} on {date}
nn: Your balance is {amount} on {date} nn

# welcome
source: welcome english!
nn: welcome english! nn

# login_welcome
source: Welcome
nn: Welcome nn

# login_welcome_msg
source: Sign into your account
nn: Sign into your account nn

# login_username
source: username
nn: username nn

# login_password
source: password
nn: password nn

# login_signbutton
source: Sign in
nn: Sign in nn

# login_languages
source: Languages
nn: Languages nn

# login_about
source: About HE
nn: About HE nn

# navbar_home
source: Home
nn: Home nn

# navbar_tools_toolsname
source: Tools
nn: Tools nn

# navbar_tools_books
source: Books
nn: Books nn

# navbar_tools_quiz
source: Quiz
nn: Quiz nn

# navbar_tools_surveys
source: Surveys
nn: Surveys nn

# navbar_offlinesetting
source: Offline Settings
nn: Offline Settings nn

# navbar_syncdetails
source: Sync Details
nn: Sync Details nn

# navbar_logout
source: Logout
nn: Logout nn

# logout_title
source: Confirm Logout ?
nn: Confirm Logout ? nn

# logout_logoutdetails
source: Please fill your password to logout!
nn: Please fill your password to logout! nn

# logout_confirmlogout
source: Confirm
nn: Confirm nn

# test_title
source: KLocalizations demo!
nn: KLocalizations demo! nn

# counter
source: Has clicado {{count}} veces
nn: Has clicado {{count}} veces nn
